#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.policy.aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
module.nosql.aws_dynamodb_table.terraform-state: Refreshing state... [id=terraform-state]
module.network.aws_api_gateway_rest_api.api: Refreshing state... [id=eh5mzxa31b]
module.policy.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
module.buckets.aws_s3_bucket_object.minimal_function_object: Refreshing state... [id=helloWorldHandler.zip]
module.logs.aws_cloudwatch_log_group.minimal_lambda_function: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
module.policy.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210910222023809000000001]
module.functions.aws_lambda_function.minimal_lambda_function: Refreshing state... [id=minimal_lambda_function]
module.network.aws_api_gateway_resource.resource: Refreshing state... [id=92o144]
module.network.aws_api_gateway_method.method: Refreshing state... [id=agm-eh5mzxa31b-92o144-GET]
module.policy.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.network.aws_api_gateway_integration.integration: Refreshing state... [id=agi-eh5mzxa31b-92o144-GET]
module.network.aws_api_gateway_deployment.example: Refreshing state... [id=4m8lgd]
module.network.aws_api_gateway_stage.example: Refreshing state... [id=ags-eh5mzxa31b-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.buckets.aws_s3_bucket_object.minimal_function_object has been changed
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
        id                 = "helloWorldHandler.zip"
      + metadata           = {}
      + tags               = {}
        # (10 unchanged attributes hidden)
    }
  # module.functions.aws_lambda_function.minimal_lambda_function has been changed
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      + layers                         = []
      + tags                           = {}
        # (19 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.logs.aws_cloudwatch_log_group.minimal_lambda_function has been changed
  ~ resource "aws_cloudwatch_log_group" "minimal_lambda_function" {
        id                = "/aws/lambda/minimal_lambda_function"
        name              = "/aws/lambda/minimal_lambda_function"
      + tags              = {}
        # (3 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_rest_api.api has been changed
  ~ resource "aws_api_gateway_rest_api" "api" {
        id                           = "eh5mzxa31b"
        name                         = "myapi"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.network.aws_api_gateway_stage.example has been changed
  ~ resource "aws_api_gateway_stage" "example" {
        id                    = "ags-eh5mzxa31b-prod"
      + tags                  = {}
      + variables             = {}
        # (9 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_integration.integration has been changed
  ~ resource "aws_api_gateway_integration" "integration" {
      + cache_key_parameters    = []
        id                      = "agi-eh5mzxa31b-92o144-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (10 unchanged attributes hidden)
    }
  # module.network.aws_api_gateway_method.method has been changed
  ~ resource "aws_api_gateway_method" "method" {
      + authorization_scopes = []
        id                   = "agm-eh5mzxa31b-92o144-GET"
      + request_models       = {}
      + request_parameters   = {}
        # (5 unchanged attributes hidden)
    }
  # module.nosql.aws_dynamodb_table.terraform-state has been changed
  ~ resource "aws_dynamodb_table" "terraform-state" {
        id             = "terraform-state"
        name           = "terraform-state"
      + tags           = {}
        # (7 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }
  # module.policy.aws_iam_role.lambda_exec_role has been changed
  ~ resource "aws_iam_role" "lambda_exec_role" {
        id                    = "lambda_exec"
      ~ managed_policy_arns   = [
          + "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function",
        ]
        name                  = "lambda_exec"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # module.policy.aws_iam_policy.lambda_logging has been changed
  ~ resource "aws_iam_policy" "lambda_logging" {
        id          = "arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function"
        name        = "iam_policy_lambda_logging_function"
      + tags        = {}
        # (6 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.buckets.data.aws_s3_bucket_object.minimal_function_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "minimal_function_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 611 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "8df41e73a83e3704f0c3982d65d47592" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Fri, 10 Sep 2021 22:20:22 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.minimal_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "minimal_function_object" {
      ~ etag               = "8df41e73a83e3704f0c3982d65d47592" -> "4daef0f6ddd160df4d0110309341825b"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.minimal_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "minimal_lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-10T22:20:36.792+0000" -> (known after apply)
      ~ source_code_hash               = "CKxHLiQZrxXwOa6XiiVuwcKpb9NKp539MfFk6R4kiUM=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ridouku, Action: `pull_request`*